In [5]:
import pandas as pd

In [6]:
a = pd.DataFrame({"Name":["Abir","Trijal","Kanishka"],"Gender":["M","M","M"],"Age":[21,22,23]})
print(a)

       Name Gender  Age
0      Abir      M   21
1    Trijal      M   22
2  Kanishka      M   23

In [7]:
a[["Name"]]

       Name
0      Abir
1    Trijal
2  Kanishka

In [8]:
a["Name"]

0        Abir
1      Trijal
2    Kanishka
Name: Name, dtype: object

In [9]:
a[["Name","Age"]]

       Name  Age
0      Abir   21
1    Trijal   22
2  Kanishka   23

In [15]:
a["Class"]:["UK","UK","UK"]
print(a)

       Name Gender  Age class State
0      Abir      M   21    UK    AS
1    Trijal      M   22    UK    WB
2  Kanishka      M   23    UK    PB

In [16]:
a["State"]=["AS","WB","PB"]
print(a)

       Name Gender  Age class State
0      Abir      M   21    UK    AS
1    Trijal      M   22    UK    WB
2  Kanishka      M   23    UK    PB